import React, { useState, useEffect } from 'react';
import ReactDOM from 'react-dom';
import dynamic from 'next/dynamic'
const Line = dynamic(
  () => import('@ant-design/plots').then(({ Line }) => Line),
  { ssr: false },
)

const LinePlot = () => {
  const [data, setData] = useState([
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2000",
      "gdp": 1211346869605.24
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2001",
      "gdp": 1339395718865.3
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2002",
      "gdp": 1470550015081.55
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2003",
      "gdp": 1660287965662.68
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2004",
      "gdp": 1955347004963.27
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2005",
      "gdp": 2285965892360.54
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2006",
      "gdp": 2752131773355.16
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2007",
      "gdp": 3550342425238.25
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2008",
      "gdp": 4594306848763.08
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2009",
      "gdp": 5101702432883.45
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2010",
      "gdp": 6087164527421.24
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2011",
      "gdp": 7551500425597.77
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2012",
      "gdp": 8532230724141.76
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2013",
      "gdp": 9570405758739.79
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2014",
      "gdp": 10438529153237.6
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2015",
      "gdp": 11015542352468.9
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2016",
      "gdp": 11137945669350.6
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2017",
      "gdp": 12143491448186.1
    },
    {
      "name": "ITエンジニア/IT系専門職",
      "year": "2018",
      "gdp": 13608151864637.9
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2000",
      "gdp": 10252345464000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2001",
      "gdp": 10581821399000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2002",
      "gdp": 10936419054000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2003",
      "gdp": 11458243878000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2004",
      "gdp": 12213729147000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2005",
      "gdp": 13036640229000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2006",
      "gdp": 13814611414000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2007",
      "gdp": 14451858650000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2008",
      "gdp": 14712844084000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2009",
      "gdp": 14448933025000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2010",
      "gdp": 14992052727000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2011",
      "gdp": 15542581104000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2012",
      "gdp": 16197007349000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2013",
      "gdp": 16784849190000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2014",
      "gdp": 17521746534000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2015",
      "gdp": 18219297584000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2016",
      "gdp": 18707188235000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2017",
      "gdp": 19485393853000
    },
    {
      "name": "クリエイティブ（Web系）",
      "year": "2018",
      "gdp": 20544343456936.5
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2000",
      "gdp": 1657816613708.58
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2001",
      "gdp": 1640246149417.01
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2002",
      "gdp": 1784473920863.31
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2003",
      "gdp": 2053018775510.2
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2004",
      "gdp": 2416931526913.22
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2005",
      "gdp": 2538680000000
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2006",
      "gdp": 2713749770009.2
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2007",
      "gdp": 3100882352941.18
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2008",
      "gdp": 2922667279411.76
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2009",
      "gdp": 2410909799034.12
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2010",
      "gdp": 2475244321361.11
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2011",
      "gdp": 2659310054646.23
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2012",
      "gdp": 2704887678386.72
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2013",
      "gdp": 2786022872706.81
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2014",
      "gdp": 3063803240208.01
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2015",
      "gdp": 2928591002002.51
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2016",
      "gdp": 2694283209613.29
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2017",
      "gdp": 2666229179958.01
    },
    {
      "name": "建設/土木/エネルギー",
      "year": "2018",
      "gdp": 2855296731521.96
    },
    {
      "name": "その他",
      "year": "2000",
      "gdp": 4887519660744.86
    },
    {
      "name": "その他",
      "year": "2001",
      "gdp": 4303544259842.72
    },
    {
      "name": "その他",
      "year": "2002",
      "gdp": 4115116279069.77
    },
    {
      "name": "その他",
      "year": "2003",
      "gdp": 4445658071221.86
    },
    {
      "name": "その他",
      "year": "2004",
      "gdp": 4815148854362.11
    },
    {
      "name": "その他",
      "year": "2005",
      "gdp": 4755410630912.14
    },
    {
      "name": "その他",
      "year": "2006",
      "gdp": 4530377224970.4
    },
    {
      "name": "その他",
      "year": "2007",
      "gdp": 4515264514430.57
    },
    {
      "name": "その他",
      "year": "2008",
      "gdp": 5037908465114.48
    },
    {
      "name": "その他",
      "year": "2009",
      "gdp": 5231382674593.7
    },
    {
      "name": "その他",
      "year": "2010",
      "gdp": 5700098114744.41
    },
    {
      "name": "その他",
      "year": "2011",
      "gdp": 6157459594823.72
    },
    {
      "name": "その他",
      "year": "2012",
      "gdp": 6203213121334.12
    },
    {
      "name": "その他",
      "year": "2013",
      "gdp": 5155717056270.83
    },
    {
      "name": "その他",
      "year": "2014",
      "gdp": 4850413536037.84
    },
    {
      "name": "その他",
      "year": "2015",
      "gdp": 4389475622588.97
    },
    {
      "name": "その他",
      "year": "2016",
      "gdp": 4926667087367.51
    },
    {
      "name": "その他",
      "year": "2017",
      "gdp": 4859950558538.97
    },
    {
      "name": "その他",
      "year": "2018",
      "gdp": 4971323079771.87
    }
  ]);

  // useEffect(() => {
  //   asyncFetch();
  // }, []);

  // const asyncFetch = () => {
  //   fetch('https://gw.alipayobjects.com/os/bmw-prod/e00d52f4-2fa6-47ee-a0d7-105dd95bde20.json')
  //     .then((response) => response.json())
  //     .then((json) => setData(json))
  //     .catch((error) => {
  //       console.log('fetch data failed', error);
  //     });
  // };
  const config = {
    data,
    xField: 'year',
    yField: 'gdp',
    seriesField: 'name',
    yAxis: {
      label: {
        formatter: (v: number) => `${(v / 10e8).toFixed(1)}`,
      },
    },
    legend: {
      position: 'top',
    },
    smooth: true,
    animation: {
      appear: {
        animation: 'path-in',
        duration: 5000,
      },
    },
  };

  return <Line {...config} />;
};

export default LinePlot